Tekla Open API Reference for Tekla Structures 2025
PropertyTypeEnum Enumeration
 The type of property: int/double/string.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum PropertyTypeEnum
Public Enumeration PropertyTypeEnum
Members
Member name | Value | Description
TYPE_INT | 0 |  The integer property type.
TYPE_DOUBLE | 1 |  The double property type.
TYPE_STRING | 2 |  The string property type.
See Also
Reference
Tekla.Structures Namespace